[
    {
        "position" : "Head of Brand & Comms",
        "company": "Tileyard London",
        "url": "",
        "description" : "Led brand unification and enhanced community experience, managing a team of three and driving collaborative efforts across departments. Achievements included revitalising communication and community events, shaping a new brand identity for TYX - Content Creation Studios, and streamlining internal processes, alongside design oversight and marketing material creation.", 
        "start": "Jan 21",
        "end": "Dec 22"
    },
    {
        "position" : "Marketing Executive & Graphic Designer",
        "company": "Tonic Studios",
        "url": "",
        "description" : "As a co-designer for an e-commerce store, I specialised in crafting product landing pages, website marketing assets, and promotional emails using MailChimp and Shopify. I collaborated closely with product designers and analysts, applying my expertise in photography, copywriting, and design to create feature-led promotional material.", 
        "start": "Jun 20",
        "end": "Jan 21"
    },
    {
        "position" : "Campaign Manager",
        "company": "The &Partnership",
        "url": "",
        "description" : "A pivotal player in managing and executing a variety of marketing campaigns across different sectors. My contributions included successfully overseeing a team of three designers, coordinating various assets, and ensuring the alignment of brand identity during a Coutts Private Bank rebrand. Additionally, I acted as the owner of creative briefs, managed delivery schedules, and collaborated with cross-functional teams to achieve marketing campaigns that met business objectives.", 
        "start": "Aug 18",
        "end": "Dec 19"
    },
    {
        "position" : "Marketing & Design Coordinator",
        "company": "Hunters & Frankau",
        "url": "",
        "description" : "Led the creation of a customer-centric website with board support and coordinated various marketing activities, including content creation, innovative advertising strategies under restrictions, and cost-effective packaging design to reach a broader customer base, maintaining brand consistency and professionalism", 
        "start": "Jun 16",
        "end": "Aug 18"
    },
    {
        "position" : "Marketing Executive",
        "company": "Tech Data",
        "url": "",
        "description" : "Developed data-driven marketing plans to enhance vendor solutions and B2B commercial channels. Assumed the role of temporary Marketing Manager, overseeing both active and planned campaigns, maintaining a 100% KPI journey, improving team effectiveness with a refined workload tracker, and cultivating strategic relationships with key clients like Dell, HP, and Intel for collaborative marketing campaigns within their portfolios.", 
        "start": "Jun 15",
        "end": "Jun 16"
    }
]